spring2021/psyc4301/psyc4301-spring2021.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-12-18 Fri 10:06 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>PSYC 4301: Psychological Tests and Measurements</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">PSYC 4301: Psychological Tests and Measurements</h1>

<div id="outline-container-org68adc67" class="outline-2">
<h2 id="org68adc67">Contact info</h2>
<div class="outline-text-2" id="text-org68adc67">
<ul class="org-ul">
<li>Professor: Thomas J. Faulkenberry, Ph.D</li>
<li>Office: Math 319</li>
<li>Office hours: <i>to be announced</i></li>
<li>Email: faulkenberry@tarleton.edu</li>
<li>Website: <a href="http://tomfaulkenberry.github.io">http://tomfaulkenberry.github.io</a></li>
<li>Phone: 254-968-9816</li>
</ul>
</div>
</div>

<div id="outline-container-org2c6d6ce" class="outline-2">
<h2 id="org2c6d6ce">Course description</h2>
<div class="outline-text-2" id="text-org2c6d6ce">
<p>
This course will provide students with an introduction to the fundamental concepts of psychological testing and measurement. It is roughly divided into three parts. In Part 1, we introduce the basic statistical concepts underlying psychological measurement, including score transformations, composite scores, and issues with dichotomous scales. In Part 2, we learn how to estimate reliability and validity of tests. Finally, in Part 3, we dive into construct validity and learn the modern techniques of factor analysis and structural equation modeling. All students are expected to have some background in basic statistical methods (PSYC 2317 or equivalent). 
</p>
</div>
</div>

<div id="outline-container-orgf74ccdd" class="outline-2">
<h2 id="orgf74ccdd">Course materials</h2>
<div class="outline-text-2" id="text-orgf74ccdd">
<ul class="org-ul">
<li>Textbook
<ul class="org-ul">
<li>there is no specific textbook for this course. I will provide you with detailed lecture notes and some readings from primary sources (i.e., journal articles). All materials will be available on Canvas. If you need a review of basic statistics, I would recommend the free textbook <i>Learning Statistics with JASP</i> by Navarro, Foxcroft, and Faulkenberry, which you can download from <a href="https://www.learnstatswithjasp.com">https://www.learnstatswithjasp.com</a>.</li>
</ul></li>
<li>Software
<ul class="org-ul">
<li>we will regularly use JASP, which is a free software package for doing both conventional and Bayesian statistics. You can download it for free from <a href="https://jasp-stats.org">https://jasp-stats.org</a> (you must have a computer running MacOS, Windows, or Linux &#x2013; it does not work well on "thin client" systems such as Chromebooks or tablets).</li>
</ul></li>
<li>Calculator
<ul class="org-ul">
<li>you should have a standalone calculator that is capable of performing the most basic scientific computations (exponents, square roots, logarithms, etc.). A graphing calculator is <i>not</i> required, though I will be using one (TI-84) when I demonstrate calculations. Find a calculator you like using!</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgaf18345" class="outline-2">
<h2 id="orgaf18345">Student learning outcomes</h2>
<div class="outline-text-2" id="text-orgaf18345">
<ol class="org-ol">
<li>Understand the basic statistical concepts that underly psychological measurement, including transformations, variance of composite scores, and how to deal with dichotomous scales</li>
<li>Apply classical test theory to various methods of estimating reliability</li>
<li>Understand the differences among content validity, criterion-related validity, and construct validity.</li>
<li>Apply methods of factor analysis and structural equation modeling to uncover latent structure of psychological constructs.</li>
</ol>
</div>
</div>

<div id="outline-container-org8d2d6f0" class="outline-2">
<h2 id="org8d2d6f0">Course format</h2>
<div class="outline-text-2" id="text-org8d2d6f0">
<p>
This course will be delivered in a hybrid-flexible ("HyFlex") format, giving you the option of attending the course face-to-face and/or online. The basic structure of each week is as follows:
</p>

<ul class="org-ul">
<li>early in the week, you will watch an online video lecture (given by me) explaining the week's topic and take a short quiz to assess your understanding.</li>

<li>you can then attend ONE in-person course meeting (either Tuesday or Thursday, but not both). The purpose of this course meeting is for me to demonstrate examples of homework problems that are assigned for the given week and give you the opportunity to ask questions. Half the class will be able to attend on Tuesday, and the other half will be able to attend on Thursday. Your specific day of the week will be assigned and communicated to you in Canvas and by email. In this way, each student will have the opportunity to attend class in-person once each week.</li>
</ul>

<p>
Note that you are not <i>required</i> to attend the face-class meetings at all! You may certainly wish to attend face-to-face, and I encourage all who can to do so. However, there are other ways to attend the weekly problem sessions:
</p>
<ul class="org-ul">
<li>You may attend either session virtually by Zoom (that is, you can watch the problem session <i>live</i> on your computer during class time).</li>
<li>You may choose to simply watch the recorded problem sessions at a convenient time later in the week. All class recordings will be posted on Canvas.</li>
</ul>

<p>
It does not matter which mode of attendance you choose &#x2013; that is the point of our "Hybrid-Flexible" course format. And, you can change your mind each week. The only thing that is <i>required</i> is that you complete the quizzes, homeworks, and exams, which I'll describe in the next section.
</p>
</div>
</div>

<div id="outline-container-orge7782b7" class="outline-2">
<h2 id="orge7782b7">Requirements and grading</h2>
<div class="outline-text-2" id="text-orge7782b7">
<ul class="org-ul">
<li>Exam 1 (100 points)</li>
<li>Exam 2 (100 points)</li>
<li>Exam 3 (100 points)</li>
<li>Homework exercises (100 points)</li>
<li>Weekly quizzes (100 points)</li>
<li><i>Total = 500 points</i></li>
</ul>

<p>
Grades will be assigned based on the percentage of points you accumulate out of these 500 points.  I will use the standard grading scale of A=90%, B=80%, etc.
</p>
</div>

<div id="outline-container-org17eed78" class="outline-3">
<h3 id="org17eed78">Exams (60% of grade)</h3>
<div class="outline-text-3" id="text-org17eed78">
<p>
There will be three exams throughout the semester, occurring approximately once every four to five weeks.  They will cover material from lectures, quizzes, and homework exercises. Exams will be "take-home", primarily consisting of short-answer questions. Exams (and homework; see below) will be submitted online on Canvas &#x2013; in my experience, it is probably easiest to hand-write your solutions neatly on clean paper and either scan or take a photo of the completed work to submit. 
</p>

<p>
Exam dates:
</p>

<ul class="org-ul">
<li>Exam 1 (due Sunday, February 21 at 11:59 pm)</li>
<li>Exam 2 (due Sunday, April 4 at 11:59 pm)</li>
<li>Exam 3 (due Sunday, May 2 at 11:59 pm)</li>
</ul>
</div>
</div>

<div id="outline-container-org0107936" class="outline-3">
<h3 id="org0107936">Weekly quizzes (20% of grade)</h3>
<div class="outline-text-3" id="text-org0107936">
<p>
At the beginning of each non-exam week, you will watch a video posted on Canvas where I introduce the week's concepts. After watching this video, you will complete an online multiple-choice quiz, the aim of which is to check for understanding of the concepts presented. Each quiz counts for 10 possible points. There will be at least 10 of these quizzes, so your 10 highest quiz scores will earn you up to 100 points for your overall quiz grade.
</p>
</div>
</div>

<div id="outline-container-orgfe82d13" class="outline-3">
<h3 id="orgfe82d13">Homework exercises (20% of grade)</h3>
<div class="outline-text-3" id="text-orgfe82d13">
<p>
In order to practice the concepts you learn this semester, you will complete a short homework assignment every week. A brief set of homework exercises will be provided to you each week. You may work collaboratively on the homework exercises, but any work submitted must reflect your own understanding of the material (in other words, don't just copy someone else's work to submit). Completed exercises should be handwritten neatly on clean paper. Each homework assignment will be due at the beginning of class on Tuesday of the week after it is assigned.
</p>
</div>
</div>
</div>
