spring2021/psyc4301/psyc4301-spring2021.html

<div id="outline-container-org9c8335a" class="outline-2">
<h2 id="org9c8335a">Course Communication</h2>
<div class="outline-text-2" id="text-org9c8335a">
<p>
Email is the primary means of official communication for this course.  If you have questions about the course, always feel free to send me an email at faulkenberry@tarleton.edu.  I only ask that you adhere to two guidelines:
</p>
<ul class="org-ul">
<li>please include the course number (PSYC 4301) in the subject line.  For example, one good way to do this is:  Subject: [PSYC 4301] Question about Exam 2</li>
<li>please use proper email etiquette.  Include a salutation (e.g., Dear Dr. Faulkenberry), complete sentences, and a closing (e.g., "Regards, Your Name").  You might be surprised how many times I get an email from a nondescript email address with no indication from WHOM the email was sent!</li>
</ul>

<p>
Also, I will send periodic class announcements via email.  Thus, it is imperative that you check your <i>Tarleton email address</i> regularly so that you don't miss any of these messages.
</p>
</div>
</div>

<div id="outline-container-org43e67b9" class="outline-2">
<h2 id="org43e67b9">CV Points for Psychology Majors</h2>
<div class="outline-text-2" id="text-org43e67b9">
<p>
All Tarleton psychology majors will be required to accumulate a certain number of "CV points" as a pass/fail component of their senior capstone course. CV is an acronym for "curriculum vitae", which is the traditional name of an academic resume. Because it is a requirement of senior capstone, no psychology major will be able to graduate without completion/verification of the required 15 CV points. Some classes may build in CV point assignments, but ultimately it is the students’ responsibility to monitor their participation and acquire points during their time at Tarleton. More information on pre-approved CV points, submission, and tracking of these points can be found in the CV Point Canvas site. Please note that submissions are graded, and may not be approved for points if they do not meet the CV standard.  If a student has a question about CV points, they should send an email to psychcvpointga@tarleton.edu.
</p>
</div>
</div>

<div id="outline-container-orgd35dfdb" class="outline-2">
<h2 id="orgd35dfdb">University Policy on "F" Grades</h2>
<div class="outline-text-2" id="text-orgd35dfdb">
<p>
Beginning in Fall 2015, Tarleton will begin differentiating between a failed grade in a class because a student never attended (F0 grade), stopped attending at some point in the semester (FX grade), or because the student did not pass the course (F) but attended the entire semester. These grades will be noted on the official transcript. Stopping or never attending class can result in the student having to return aid monies received.  For more information see the Tarleton Financial Aid website.
</p>
</div>
</div>

<div id="outline-container-org03e3dd0" class="outline-2">
<h2 id="org03e3dd0">Academic Honesty</h2>
<div class="outline-text-2" id="text-org03e3dd0">
<p>
Tarleton State University expects its students to maintain high standards of personal and scholarly conduct. Students guilty of academic dishonesty are subject to disciplinary action. Cheating, plagiarism (submitting another person’s materials or ideas as one’s own), or doing work for another person who will receive academic credit are all disallowed. This includes the use of unauthorized books, notebooks, or other sources in order to secure of give help during an examination, the unauthorized copying of examinations, assignments, reports, or term papers, or the presentation of unacknowledged material as if it were the student’s own work. Disciplinary action may be taken beyond the academic discipline administered by the faculty member who teaches the course in which the cheating took place.
</p>

<p>
In particular, any exam taken online must be completed without the aid of any unauthorized resource (including using any search engine, Google, etc.).  Authorized resources are limited only to the official textbook and any lecture notes from the course.  Any other authorized resources will be provided to you before the exam.  The minimum sanction for violation of this policy is a grade of 0 on the affected exam.
</p>

<p>
Each student’s honesty and integrity are taken for granted. However, if I find evidence of academic misconduct I will pursue the matter to the fullest extent permitted by the university. ACADEMIC MISCONDUCT OR DISHONESTY WILL RESULT IN A GRADE OF F FOR THE COURSE.  Students are strongly advised to avoid even the <i>appearance</i> of academic misconduct. 
</p>
</div>
</div>

<div id="outline-container-orgdf325f6" class="outline-2">
<h2 id="orgdf325f6">Academic Affairs Core Value Statements</h2>
<div class="outline-text-2" id="text-orgdf325f6">
</div>
<div id="outline-container-org33185c9" class="outline-3">
<h3 id="org33185c9">Academic Integrity Statement</h3>
<div class="outline-text-3" id="text-org33185c9">
<p>
Tarleton State University's core values are integrity, leadership, tradition, civility, excellence, and service.  Central to these values is integrity, which is maintaining a high standard of personal and scholarly conduct.  Academic integrity represents the choice to uphold ethical responsibility for one’s learning within the academic community, regardless of audience or situation.
</p>
</div>
</div>

<div id="outline-container-org03868c4" class="outline-3">
<h3 id="org03868c4">Academic Civility Statement</h3>
<div class="outline-text-3" id="text-org03868c4">
<p>
Students are expected to interact with professors and peers in a respectful manner that enhances the learning environment. Professors may require a student who deviates from this expectation to leave the face-to-face (or virtual) classroom learning environment for that particular class session (and potentially subsequent class sessions) for a specific amount of time. In addition, the professor might consider the university disciplinary process (for Academic Affairs/Student Life) for egregious or continued disruptive behavior.
</p>
</div>
</div>

<div id="outline-container-org65709ec" class="outline-3">
<h3 id="org65709ec">Academic Excellence Statement</h3>
<div class="outline-text-3" id="text-org65709ec">
<p>
Tarleton holds high expectations for students to assume responsibility for their own individual learning. Students are also expected to achieve academic excellence by:
</p>
<ul class="org-ul">
<li>honoring Tarleton’s core values, upholding high standards of habit and behavior.</li>
<li>maintaining excellence through class attendance and punctuality, preparing for active participation in all learning experiences.</li>
<li>putting forth their best individual effort.</li>
<li>continually improving as independent learners.</li>
<li>engaging in extracurricular opportunities that encourage personal and academic growth.</li>
<li>reflecting critically upon feedback and applying these lessons to meet future challenges.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org1c4e358" class="outline-2">
<h2 id="org1c4e358">Students with Disabilities Policy</h2>
<div class="outline-text-2" id="text-org1c4e358">
<p>
It is the policy of Tarleton State University to comply with the Americans with Disabilities  Act (www.ada.gov) and other applicable laws.  If you are a student with a disability seeking accommodations for this course, please contact the Center for Access and Academic Testing, at 254.968.9400 or caat@tarleton.edu. The office is located in Math 201. More information can be found at www.tarleton.edu/caat or in the University Catalog.​
</p>

<p>
<b>Note:  any changes to this syllabus will be communicated to you by the instructor!</b>
</p>
</div>
</div>
