spring2021/psyc4301/psyc4301-spring2021.org
** Schedule of class meetings

 | Week | Dates        | Topic                                      |
 |------+--------------+--------------------------------------------|
 |    1 | Jan 19,21    | Introduction to the course                 |
 |    2 | Jan 26,28    | Transformations of test scores             |
 |    3 | Feb 2,4      | Statistical properties of composite scores |
 |    4 | Feb 9,11     | Issues with dichotomous scales             |
 |    5 | Feb 16,18    | No class meetings - complete *Exam 1*      |
 |    6 | Feb 23,25    | Classical test theory                      |
 |    7 | Mar 2,4      | Estimating reliability of tests            |
 |    8 | Mar 9,11     | Criterion-related validity                 |
 |    9 | Mar 16,18    | /No class meeting -- Spring Break/         |
 |   10 | Mar 23,25    | Introduction to construct validity         |
 |   11 | Mar 30,Apr 1 | No class meeting - complete *Exam 2*       |
 |   12 | Apr 6,8      | Exploratory factor analysis                |
 |   13 | Apr 13,15    | Confirmatory factor analysis               |
 |   14 | Apr 20,22    | Structural equation modeling               |
 |   15 | Apr 27,29    | No class meeting - complete *Exam 3*       |
 

