spring2021/psyc4301/psyc4301-spring2021.html

<div id="outline-container-orgc9f5ac7" class="outline-2">
<h2 id="orgc9f5ac7">Schedule of class meetings</h2>
<div class="outline-text-2" id="text-orgc9f5ac7">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Week</th>
<th scope="col" class="org-left">Dates</th>
<th scope="col" class="org-left">Topic</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-left">Jan 19,21</td>
<td class="org-left">Introduction to the course</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">Jan 26,28</td>
<td class="org-left">Transformations of test scores</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">Feb 2,4</td>
<td class="org-left">Statistical properties of composite scores</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-left">Feb 9,11</td>
<td class="org-left">Issues with dichotomous scales</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-left">Feb 16,18</td>
<td class="org-left">No class meetings - complete <b>Exam 1</b></td>
</tr>

<tr>
<td class="org-right">6</td>
<td class="org-left">Feb 23,25</td>
<td class="org-left">Classical test theory</td>
</tr>

<tr>
<td class="org-right">7</td>
<td class="org-left">Mar 2,4</td>
<td class="org-left">Estimating reliability of tests</td>
</tr>

<tr>
<td class="org-right">8</td>
<td class="org-left">Mar 9,11</td>
<td class="org-left">Criterion-related validity</td>
</tr>

<tr>
<td class="org-right">9</td>
<td class="org-left">Mar 16,18</td>
<td class="org-left"><i>No class meeting &#x2013; Spring Break</i></td>
</tr>

<tr>
<td class="org-right">10</td>
<td class="org-left">Mar 23,25</td>
<td class="org-left">Introduction to construct validity</td>
</tr>

<tr>
<td class="org-right">11</td>
<td class="org-left">Mar 30,Apr 1</td>
<td class="org-left">No class meeting - complete <b>Exam 2</b></td>
</tr>

<tr>
<td class="org-right">12</td>
<td class="org-left">Apr 6,8</td>
<td class="org-left">Exploratory factor analysis</td>
</tr>

<tr>
<td class="org-right">13</td>
<td class="org-left">Apr 13,15</td>
<td class="org-left">Confirmatory factor analysis</td>
</tr>

<tr>
<td class="org-right">14</td>
<td class="org-left">Apr 20,22</td>
<td class="org-left">Structural equation modeling</td>
</tr>

<tr>
<td class="org-right">15</td>
<td class="org-left">Apr 27,29</td>
<td class="org-left">No class meeting - complete <b>Exam 3</b></td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: Spring 2021</p>
<p class="date">Created: 2020-12-18 Fri 10:06</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
